{"reviewText":"I usually wear a size 8 and they fit fine. These are way too narrow. Thought they might stretch out but they didnt. Had to give away.","overall":1,"vote":null}
{"reviewText":"After using this shoes seven times for regular activities like walking or dancing the sole came out. I am very disappointed. I don't recommend this product at all. The worse part is that I can not return this item because the return window closed 4 days ago.","overall":1,"vote":14.0}
{"reviewText":"I wore these shoe one time, from the airport in Omaha, NE to the airport in Phoenix, AZ. When I arrived in Phoenix, the left shoe\/sole started squeaking and won't stop. I want to return for a refund. Need instructions for returning as no paperwork was in my package when it arrived.","overall":1,"vote":null}
{"reviewText":"Ordered 9(m) received 9 Wide for the second time. Returned them for the second time.","overall":1,"vote":null}
{"reviewText":"Oops! I returned these because I ordered wrong size!","overall":1,"vote":null}
{"reviewText":"I bought these for gym training - weight class and dance class (body jam, Zumba) - and really wanted to like them, since I loved the color and the light weight feel. But when I worked out high impact, my toes tingled, went numb and cramped because the toe bed is very narrow. Also, there wasn't enough cushion for me. When doing lunges, the ball of my feet hurt. Can't return them because I wore them several times. These might be fine for someone with a narrow foot.","overall":2,"vote":6.0}
{"reviewText":"Comfortable shoe.  First time I've ever bought nikes that feel so large.  It feels about 1\/2 size too big.  I bought 7.5.  I normally wear exactly that size and on occasion an 8.","overall":2,"vote":null}
{"reviewText":"They run big and are super uncomfortable and the soles squeak. They don't breathe at all.","overall":2,"vote":null}
{"reviewText":"Tried one in the store and bought it online but it was a different  kind of shoe . Too big , different fit !","overall":2,"vote":2.0}
{"reviewText":"These shoes are poorly constructed and I don't expect them to last more that one summer.  Would not recommend, and will not order another Nike downshifter series again","overall":2,"vote":null}
{"reviewText":"ok but too big","overall":3,"vote":null}
{"reviewText":"I always get a half size up in my tennis shoes. For some reason these feel to big in the heel area and wide.","overall":3,"vote":7.0}
{"reviewText":"l always buy Nike shoes and been happy so far, but this time my left shoe fit perfectly while the right shoe was too loose on my heal and when I tighten it more it was hurting side of my foot.","overall":3,"vote":null}
{"reviewText":"Nice","overall":3,"vote":null}
{"reviewText":"I bought a pair of these in my size, but they are too small. I can get my feet in them but not comfortably. It's too bad because I can tell the soles are comfortable. Of course, now I've work them to work so I can't return them.","overall":3,"vote":null}
{"reviewText":"Very good overall.\nNow Ive been a huge Sketchers Go Walk fan for some time and the only reason I tried these instead of the latest number 4 of those is because the tread looked too slippery to me.\nThese shoes are very sturdy and the grip of the soles has been very solid so far. I use them for basic workout cardio and cross training, as well as work as a massage therapist (I go through shoes fast enough that Ive recently consolidated).\nIf you're a Go Walk fan, these do not offer the same level of cushion-comfort as those, HOWEVER, they offer the kind of long-term comfort to make them a durable option.\nThe material of the shoes seem very durable and the breathable. My feet do not feel hot in them.\nNow these shoes are ideal for a basic workout or cross training, I would not get them to do 25,000 steps in Walt Disney World.\nSolid choice, overall.","overall":4,"vote":null}
{"reviewText":"The picture makes the shoe look like it has a \"boxier\" toe rather than the \"pointier\" toe that it actually has. I have wider feet and generally need to buy a size or half size longer to get a comfortable width (in any brand of shoe). I was shooting for a rounder, broader toe design which is more comfortable for me, and I feel that the pictures of this shoe didn't accurately depict what I received, in that one detail. Otherwise, \"the shoe fits.\" So I am wearing it.","overall":4,"vote":null}
{"reviewText":"Purchased to wear for weightlifting and Zumba. Zumba trial was last night, and they were great! Super comfortable, good ventilation! Not too much padding, very minimalist, which is just what I wanted","overall":4,"vote":null}
{"reviewText":"Fits good, very lightweight.","overall":4,"vote":null}
{"reviewText":"This is a great shoe for in gym workouts. I did take a 10 mile hike and had a blister on my pinky, but other than that these are very comfortable shoes!","overall":4,"vote":null}
{"reviewText":"I bought these for my wife. She saw them in the store but did not have their size so i ordered on amazon. She loves them . She already had for a couple of months and no complains at all. One of her favorites shoes for running or for her job since she walks a lot in the warehouse. Now she loves me more. :)","overall":5,"vote":null}
{"reviewText":"These are the most comfortable shoes I've used for working out. Extremely light weight and flexible. Loved them so much I purchased two more pair in different colors.","overall":5,"vote":null}
{"reviewText":"Best tennis shoes I've had all my life. Very comfortable out the box. I would buy 10 pairs of these shoes if had the money.","overall":5,"vote":null}
{"reviewText":"I really love these shoes.  They are attractive and very comfortable.  They work well for my daily workout and fit well.","overall":5,"vote":null}
{"reviewText":"There is about a 1\/2 inch of extra space from the tip of my big toe to the front of the shoe. That's okay, though. I usually wear socks, so it doesn't feel too big, even if it does make your foot look a bit long.\n\nThe colors are vibrant, and the sole has plenty of grip, even on a slippery floor. I wore them for most of the day and they are comfortable.\n\nOverall, I'm very pleased with this shoe.","overall":5,"vote":3.0}
