{"reviewText":"Returning these. the pictures on here make the shoe appear all black with a touch of pink in the check. however, the whole shoe has pink coming through. I was looking for an all black shoe. I ordered the Nike Women's Flex Supreme TR3 instead and love them!!!","overall":1}
{"reviewText":"After using this shoes seven times for regular activities like walking or dancing the sole came out. I am very disappointed. I don't recommend this product at all. The worse part is that I can not return this item because the return window closed 4 days ago.","overall":1}
{"reviewText":"After less than a week the sole ripped off on the outside of the shoe","overall":1}
{"reviewText":"wrong shoes","overall":1}
{"reviewText":"I wore these shoe one time, from the airport in Omaha, NE to the airport in Phoenix, AZ. When I arrived in Phoenix, the left shoe\/sole started squeaking and won't stop. I want to return for a refund. Need instructions for returning as no paperwork was in my package when it arrived.","overall":1}
{"reviewText":"I returned these as they were not true to size. They ran large.","overall":2}
{"reviewText":"Color was not at all what i expected.  It was more orange then red.  Not sure that I am going to keep them.","overall":2}
{"reviewText":"Tried one in the store and bought it online but it was a different  kind of shoe . Too big , different fit !","overall":2}
{"reviewText":"I've always gotten this size in Nike shoes with similar description, but these are too long- at least an inch and 1\/2.","overall":2}
{"reviewText":"These shoes are poorly constructed and I don't expect them to last more that one summer.  Would not recommend, and will not order another Nike downshifter series again","overall":2}
{"reviewText":"Super light and very comfortable. I'm a runner and they lack a bit in arch support, so the soles of my feet are a sore. I'm going to add an insert to try fix the problem.","overall":3}
{"reviewText":"On the left shoe, there were two stained yellow spots.","overall":3}
{"reviewText":"This is a shoe I will wear with black dress pants or jeans when I need comfort and a little style, but I am not impressed.  This is a very flimsy shoe with little support at all.  Not like any Nike I've ever purchased in the past.  It looks nice, but it's not comfortable.","overall":3}
{"reviewText":"These are a bit longer than they should be. I usually wear a 9 but could have easily ordered a 8.5. The width is accurate.\n\nThe pink is even pinker than shown and the light gray is over the very bright pink so it isn't as gray as shown in the picture. It makes the shoe a bit overwhelming. Also two grommets on each shoe is dark. I'm not referring to the dark grommets closer to the toe as shown in the photo, I'm talking about two grommets up at the top of of the laces (opposite side of side shown in photo). I thought it was faulty at first until I noticed they were on the same side of each shoe. Kind of odd and not pictured.\n\nOverall, they are very comfortable shoes which is why I am keeping them...even if you can see me coming from a mile away.","overall":3}
{"reviewText":"Super cute shoe however runs wide and big, I'm a size 10 however this size 10 is too big. I went to a sporting goods store and tried the same shoe on  turns out with this particular shoe I'm a 9.5, so order half the size u normally are.","overall":3}
{"reviewText":"Very comfortable sneakers and I also like the way it fits.","overall":4}
{"reviewText":"Comfortable athletic shoe,  good for the gym (ellipical, tredmill, etc.) Fit is good, and shoe is really lightweight and comfy.","overall":4}
{"reviewText":"Very comfortable.","overall":4}
{"reviewText":"Perfect for the gym, could use a little more support in the toe area but very comfortable and light. Fit true to size.","overall":4}
{"reviewText":"I was really excited when I opened the box to see the color is exactly like the image shows! I have the Nike flex tr 5 and used the same size to order these. They are a little bigger than expected but still comfortable.","overall":4}
{"reviewText":"Very comfortable shoes. I have wide feet with falling arches. These help both and are comfortable enough that I can be in them all day long.","overall":5}
{"reviewText":"Love them! Fit exactly as expected in length and width! I would definitely buy these again.","overall":5}
{"reviewText":"Ordered half a size larger than my usual shoe size and fits perfectly.","overall":5}
{"reviewText":"My favorite cross trainers!","overall":5}
{"reviewText":"My knees were bothering me during HIIT workouts so i  purchased these shoes after researching many styles.  Fit true to size and are lightweight.  My knees feel better so so hard so good.  They are cute in too!!","overall":5}
